Revit 2027 API
BuiltInFailures.PointFailures.EdgeHostedPointToBeUnhosted Property
 A point element in a family was hosted on an edge outside its family and the edge no longer exists. The point will remain placed but with no host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EdgeHostedPointToBeUnhosted { get; }
Public Shared ReadOnly Property EdgeHostedPointToBeUnhosted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EdgeHostedPointToBeUnhosted {
	FailureDefinitionId^ get ();
}
static member EdgeHostedPointToBeUnhosted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace